import sys
import re
from pathlib import Path

folder = Path(sys.argv[1])
subtitle = [i for ext in ("smi","srt") for i in folder.glob(f"*.{ext}")]
changeList = [("다구","다고"),("라구","라고"),("자구","자고"),("냐구","냐고"),("구요","고요"),("아니구","아니고"),("누고요","누구요"),("맘","마음"),("딴","다른"),("그다른","그딴"),("젠장","씨발"),("제기랄","씨발"),("제길","씨발"),("빌어먹을","미친"),("되서","돼서"),("되요","돼요"),("되야","돼야"),("되도","돼도"),("돼도록","되도록"),("됬","됐"),("돼나","되나"),("뵈야","봬야"),("맙소사","세상에"),("께","게"),("함게","함께"),("게서","께서"),("에께서","에게서"),("게선","께선"),("님게","님께"),("암튼","아무튼"),("그닥","그다지"),("댓가","대가"),("갯수","개수"),("몇일","며칠"),("몇 일","며칠"),("오랫만","오랜만"),("어쨋","어쨌"),("왠","웬"),("웬지","왠지"),("이예요","이에요")]
# a = [["떄","때"],[/되(가|도|버|서|야|요|줘)/g,"돼$1"],["돼도록","되도록"],[/돼도\s*않는/g,"되도않는"],["됬","됐"],["됌","됨"],[/돼(다|냐|니)/g,"되$1"],["됀","된"],["됄","될"],["됍니","됩니"],[/안\s*돼는/g,"안 되는"],[/않\s*하/g,"안 하"],["일부로","일부러"],["1도","하나도"],["역활","역할"],["깨닳","깨달"],[/들어(나|남)/g,"드러$1"],[/(일일|간간)히/g,"$1이"],[/갈\s*때까지/g,"갈 데까지"],[/최근\s*근황/g,"근황"],[/몇\s*일/g,"며칠"],["확율","확률"],[/(^너가)|(\s+너가)/g,"네가"],[/(니|내)\s*꺼/g,"$1 거"],[/어의\s*없/g,"어이 없"],["당췌","당최"]]

for sub in subtitle:
    print(sub.name)
    data = sub.read_text(encoding="utf-8").splitlines()
    for i,line in enumerate(data):
        for change in changeList:
            if change[0] in line:
                print(line,end=" | ")
                line = line.replace(change[0],change[1])
                data[i] = line
                print(data[i])
    sub.with_stem(sub.stem+"_").write_text("\n".join(data),encoding="utf-8")
    print("")